# 사과나무(다이아몬드)

# N*N 격자판에 숫자가 채워져있다. (N은 홀수)
# 격자판 내부 다이아몬드에 해당하는 숫자만 합쳐 출력

# 입력예제
# 5
# 10 13 10 12 15
# 12 39 30 23 11
# 11 25 50 53 15
# 19 27 29 37 27
# 19 13 30 13 19

# 출력예제
# 329

# 7 // 2 == 3 - i(0, 1, 2, 3) = > 3, 2, 1, 0
# _ _ _ 4 _ _ _ = > 0 1 2  4 5 6 (3)
# _ _ 3 4 5 _ _ = > 0 1      5 6 (2 3 4)
# _ 2 3 4 5 6 _ = > 0          6 (1 2 3 4 5)
# 1 2 3 4 5 6 7
# _ 2 3 4 5 6 _
# _ _ 3 4 5 _ _
# _ _ _ 4 _ _ _

N = int(input())
arr = [list(map(int, input().split())) for i in range(N)]
cnt = 0
s = e = N//2
for i in range(N):
    for j in range(s, e+1):
        cnt += arr[i][j]
    if i < N//2:
        s -= 1
        e += 1
    else:
        s += 1
        e -= 1
print(cnt)
